en/blog/lilypond-files-as-functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-03 Wed 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LilyPond Files as Functions</title>
<meta name="author" content="Richard Davis" />
<meta name="generator" content="Org Mode" />
<link href="/styles/org.css" rel="stylesheet" />
<link href="/styles/style.css" rel="stylesheet" />
<link href="https://fonts.googleapis.com/css?family=JetBrains+Mono&?family=Open+Sans" rel="stylesheet" />
<link rel="alternate" type="application/rss+xml" title="Blog RSS Feed" href="/en/blog/rss.xml">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="content" class="content">
<h1 class="title">LilyPond Files as Functions
<br />
<span class="subtitle">Richard Davis, Blog</span>
</h1>
<div class="org-center">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="../index.html">Home</a></td>
<td class="org-left"><a href="../about.html">About</a></td>
<td class="org-left"><a href="../events.html">Events</a></td>
<td class="org-left"><a href="../listening.html">Listening</a></td>
<td class="org-left"><a href="index.html">Blog</a></td>
<td class="org-left"><a href="../../fr/index.html">FR</a></td>
</tr>
</tbody>
</table>
</div>

<p>
Salutations!
</p>

<p>
I'm very gradually switching to LilyPond as my main notation software.
As part of this, I'm trying to optimize my workflow as much as possible so as to minimize overall pain.
One way to do so is with scheme <a href="http://lilypond.org/doc/v2.25/Documentation/notation/substitution-function-syntax">music functions</a>, which enable the programmer to substitute arguments into a music expression.
This is incredibly powerful, but it does have its limitations, the main one being that it can only return music, not a score or something like that.
</p>

<p>
That's where this post comes in.
I've developed a fun workaround that allows for calling a function-like object and getting back something that is not strictly music.
</p>

<div id="outline-container-orgf29a09f" class="outline-2">
<h2 id="orgf29a09f">Explanation</h2>
<div class="outline-text-2" id="text-orgf29a09f">
<p>
This workaround uses the <code>\include</code> functionality to treat a file like a function.
Files on their own don't take parameters, but it is possible to make them behave like they do.
The way to do so is by including variable substitutions and function calls (<code>\var</code> or <code>\func</code>) that are undefined in the function file.
To pass parameters to the file, simply define those variables or functions before "calling" (or <code>\include</code>-ing) the file.
These parameters can easily be redefined and the file can be called again with new values.
</p>
</div>
</div>

<div id="outline-container-org5bd099a" class="outline-2">
<h2 id="org5bd099a">Example</h2>
<div class="outline-text-2" id="text-org5bd099a">
<p>
When working with multi-movement pieces, which have a <code>\score</code> block for each movement, the <code>\score</code> is the most pressing thing to have a function for, and it is the reason I developed this workaround.
In a piece, I'm working on right now, the score for each movement looks something like this:
</p>

<div class="org-src-container">
<pre class="src src-lilypond">\include "./common.ily"

\score {
  \header {
    piece = \markup \movement-title \piece % piece undefined
    tagline = ""
  }

  % partStaff defined in common.ily
  \partStaff \instrName \shortInstrName \notes % all args undefined in this line

  % my layout preferences
  \layout {
    \context { \Staff \override Hairpin.to-barline = ##f }
    \context {
      \Score
      \override Glissando.minimum-length = 4
      \override Glissando.springs-and-rods = #ly:spanner::set-spacing-rods
      \override Glissando.thickness = 2
      \override SpacingSpanner.shortest-duration-space = 4.0
    }
  }
}
</pre>
</div>

<p>
Repeating this for every movement would be tedious, and if I had to change anything (e.g. a layout setting) I would have to do so for every one of seven movements.
This becomes unmaintainable quickly.
Instead, I do as described above, and <code>\include</code> this file like a function for when I need a score:
</p>

<div class="org-src-container">
<pre class="src src-lilypond">% normal header
\version "2.24.3"
\language "english"

\include "../common/common.ily"
% defs.ily defines all of the arguments the movementScore "function"
\include "./defs.ily"

% include the toplevel header for things like title, subtitle, composer, and
% tagline
\include "../book-header.ily"
% call the function!
\include "../common/movementScore.ily"
</pre>
</div>

<p>
And we're done!
Excluding comments and blank lines, the score for each movement is six lines long, and is identical between movements.
</p>
</div>
</div>

<div id="outline-container-org239c7dd" class="outline-2">
<h2 id="org239c7dd">Conclusion</h2>
<div class="outline-text-2" id="text-org239c7dd">
<p>
In developing an engraving workflow in LilyPond, I imagine the most important area to focus my efforts will be these creative ways to minimize repetition and to streamline the writing process.
Someday I'll hopefully have it down to a science, but in the meantime, if any readers have any tips or tricks they'd like to share, I'd love to hear about them via email at <a href="mailto:davisrichard437@gmail.com">davisrichard437@gmail.com</a>! 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="copyright">© Richard Davis, 2024-04-03 Wed 13:14</p>
</div>
</body>
</html>
